[
  {
    "id": 1,
    "entity_id": 1,
    "title": "Design patterns",
    "snippet": "Singletons – Each component dependent on a service gets a reference to the single instance generated by the service factory.",
    "created": 1418812571,
    "tags": ["patterns", "developer", "javascript"],
    "levels": [ "2" ]
  },
  {
    "id": 2,
    "entity_id": 2,
    "title": "Angular services",
    "snippet": "Angular services are substitutable objects that are wired together using dependency injection (DI). You can use services to organize and share code across your app.",
    "created": 1418812571,
    "tags": ["services", "angular", "developer"],
    "levels": [ "2", "3" ]
  },
  {
    "id": 3,
    "entity_id": 5,
    "title": "Bootstrap",
    "snippet": "During application bootstrap, before Angular goes off creating all services, it configures and instantiates all providers. We call this the configuration phase of the application life-cycle. During this phase, services aren't accessible because they haven't been created yet.",
    "created": 1418812571,
    "tags": ["bootstrap", "angular"],
    "levels": [ "3", "1" ]
  },
  {
    "id": 4,
    "entity_id": 7,
    "title": "Angular filters",
    "snippet": "Using Factory recipes, you can also define Angular's filters and animations, but the controllers are a bit special. You create a controller as a custom type that declares its dependencies as arguments for its constructor function.",
    "created": 1418812571,
    "tags": ["javascript", "angular"],
    "levels": [ "4", "2" ]
  },
  {
    "id": 5,
    "entity_id": 8,
    "title": "Wireshark",
    "snippet": "Would you know how to use Wireshark to do this? I've never really used it, and it appears to show all network traffic, and shows raw packets",
    "created": 1418812571,
    "tags": ["developer", "wireshark"],
    "levels": [ "1", "2" ]
  },
  {
    "id": 6,
    "entity_id": 12,
    "title": "Chrome developer",
    "snippet": "Chrome developer tools now have the ability to list WebSocket frames and also inspect the data if the frames are not binary.",
    "created": 1418812571,
    "tags": ["developer", "chrome"],
    "levels": [ "1", "4" ]
  }
]
